In [1]:
import pandas as pd
file_path = "C:/Users/Sivaraman/Desktop/study/data analytics/Data (for practice)/bank_details_withdate.xlsx"
df = pd.read_excel(file_path)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep
0         0.00              1  101348.88 2023-01-01     Bank
1         0.00              1  101348.88 2023-01-02     Bank
2    159660.80              3  112542.58 2023-01-03     Bank
3    159660.80              3  112542.58 2023-01-04     Bank
4    125510.82              1   79084.10 2023-01-05     Bank
..         ...            ...        ...        ...      ...
448   68065.80              1  138777.00 2025-01-31  Entrepr
449  127299.34              2  124694.99 2025-01-31  Entrepr
450  174937.64              1   40084.32 2025-01-31  Entrepr
451       0.00              2  119232.33 2025-01-31  Entrepr
452  110071.10              1   43921.36 2025-01-31  Entrepr

[453 rows x 12 columns]

In [2]:
df.dtypes

CustomerId                int64
Name                     object
CreditScore               int64
Country                  object
Gender                   object
Age                       int64
Tenure                    int64
Balance                 float64
NumOfProducts             int64
Salary                  float64
Date             datetime64[ns]
Dep                      object
dtype: object

In [3]:
df['Date'] = df['Date'].astype('str')

In [4]:
df.dtypes

CustomerId         int64
Name              object
CreditScore        int64
Country           object
Gender            object
Age                int64
Tenure             int64
Balance          float64
NumOfProducts      int64
Salary           float64
Date              object
Dep               object
dtype: object

In [8]:
'''df["Date"] = pd.to_datetime(df["Date"], format="%d-%m-%Y")'''
df["Date"] = pd.to_datetime(df["Date"], format = "%Y-%m-%d")

In [9]:
df.dtypes

CustomerId                int64
Name                     object
CreditScore               int64
Country                  object
Gender                   object
Age                       int64
Tenure                    int64
Balance                 float64
NumOfProducts             int64
Salary                  float64
Date             datetime64[ns]
Dep                      object
dtype: object

In [11]:
'''
df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month
df["Day"] = df["Date"].dt.day
df["Weekday"] = df["Date"].dt.day_name()

print(df)

'''
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df['Weekday'] = df['Date'].dt.day_name()

In [12]:
print(df1)

NameError: name 'df1' is not defined

In [13]:
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2025-01-31  Entrepr  2025      1

     Day    Weekday
0      1     Sunday
1      2     Monday
2      3    Tuesday
3      4  Wednesday
4      5   Thursday
..   ...        ...
448   31     Friday
449   31     Friday
450   31     Friday
451   31     Friday
452   31     Friday

[453 rows x 16 columns]

In [18]:
# it is used to save df(data_frame) in specific folder
df.to_excel(r"C:\Users\Sivaraman\Desktop\study\data analytics\practice\files_from_df.xlsx", index = False)

In [2]:
import pandas as pd
file_path = r"C:\Users\Sivaraman\Desktop\study\data analytics\practice\files_from_df.xlsx"
df = pd.read_excel(file_path)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2025-01-31  Entrepr  2025      1

     Day    Weekday
0      1     Sunday
1      2     Monday
2      3    Tuesday
3      4  Wednesday
4      5   Thursday
..   ...        ...
448   31     Friday
449   31     Friday
450   31     Friday
451   31     Friday
452   31     Friday

[453 rows x 16 columns]

In [10]:
'''df['month_name'] = df['Date'].dt.strftime("%B")
print(df[['Date', 'month_name']])'''

df['monthname'] = df['Date'].dt.strftime("%B")
print(df[['Date', 'monthname']])

          Date monthname
0   2023-01-01   January
1   2023-01-02   January
2   2023-01-03   January
3   2023-01-04   January
4   2023-01-05   January
..         ...       ...
448 2025-01-31   January
449 2025-01-31   January
450 2025-01-31   January
451 2025-01-31   January
452 2025-01-31   January

[453 rows x 2 columns]

In [14]:
#filtered date by date

filtered_date = df[df['Date'] > "2023-01-02"]
print(filtered_date)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
5      15574012         Chu          645    Spain    Male   44       8
6      15574012    Bartlett          822   France    Male   50       7
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
5    113755.78              2  149756.71 2023-01-06     Bank  2023      1
6         0.00              2   10062.80 2023-01-07     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2025-01-31  Entrepr  2025      1

     Day    Weekday month_name monthname  filtered_date
2      3    Tuesday    January   January           True
3      4  Wednesday    January   January           True
4      5   Thursday    January   January           True
5      6     Friday    January   January           True
6      7   Saturday    January   January           True
..   ...        ...        ...       ...            ...
448   31     Friday    January   January           True
449   31     Friday    January   January           True
450   31     Friday    January   January           True
451   31     Friday    January   January           True
452   31     Friday    January   January           True

[451 rows x 19 columns]

In [16]:
df['day_since_start'] = (df['Date']-df['Date'].min()).dt.days
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2025-01-31  Entrepr  2025      1

     Day    Weekday month_name monthname  filtered_date  day_since_start
0      1     Sunday    January   January          False                0
1      2     Monday    January   January          False                1
2      3    Tuesday    January   January           True                2
3      4  Wednesday    January   January           True                3
4      5   Thursday    January   January           True                4
..   ...        ...        ...       ...            ...              ...
448   31     Friday    January   January           True              761
449   31     Friday    January   January           True              761
450   31     Friday    January   January           True              761
451   31     Friday    January   January           True              761
452   31     Friday    January   January           True              761

[453 rows x 20 columns]

In [1]:
import pandas as pd
file_path = r"C:\Users\Sivaraman\Desktop\study\data analytics\practice\files_from_df.xlsx"
df = pd.read_excel(file_path)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2025-01-31  Entrepr  2025      1

     Day    Weekday
0      1     Sunday
1      2     Monday
2      3    Tuesday
3      4  Wednesday
4      5   Thursday
..   ...        ...
448   31     Friday
449   31     Friday
450   31     Friday
451   31     Friday
452   31     Friday

[453 rows x 16 columns]

In [2]:
df = df[df['Date'] != '2025-01-31']

In [3]:
print(df)

     CustomerId          Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602      Hargrave          619   France  Female   42       2
1      15634602      Hargrave          619   France  Female   42       2
2      15634602          Onio          502   France  Female   42       8
3      15634602          Onio          502   France  Female   42       8
4      15737888      Mitchell          850    Spain  Female   43       2
..          ...           ...          ...      ...     ...  ...     ...
429    15806467         Boyle          568  Germany    Male   40       1
430    15597602  Nwachinemelu          619  Germany    Male   57       3
431    15743040    Kuznetsova          724  Germany    Male   41       2
432    15705521        Pisani          548  Germany  Female   33       0
433    15595039         Manna          545  Germany  Female   37       8

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
429   99282.63              1  134600.94 2025-01-26  Entrepr  2025      1
430  137946.39              1   72467.99 2025-01-27  Entrepr  2025      1
431  127892.57              2  199645.45 2025-01-28  Entrepr  2025      1
432  101084.36              1   42749.85 2025-01-29  Entrepr  2025      1
433  114754.08              1  136050.44 2025-01-30  Entrepr  2025      1

     Day    Weekday
0      1     Sunday
1      2     Monday
2      3    Tuesday
3      4  Wednesday
4      5   Thursday
..   ...        ...
429   26     Sunday
430   27     Monday
431   28    Tuesday
432   29  Wednesday
433   30   Thursday

[434 rows x 16 columns]

In [4]:
import pandas as pd
file_path = r"C:\Users\Sivaraman\Desktop\study\data analytics\practice\files_from_df.xlsx"
df = pd.read_excel(file_path)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary                 Date      Dep  Year  \
0         0.00              1  101348.88  2023-01-01 00:00:00     Bank  2023
1         0.00              1  101348.88  2023-01-02 00:00:00     Bank  2023
2    159660.80              3  112542.58  2023-01-03 00:00:00     Bank  2023
3    159660.80              3  112542.58  2023-01-04 00:00:00     Bank  2023
4    125510.82              1   79084.10  2023-01-05 00:00:00     Bank  2023
..         ...            ...        ...                  ...      ...   ...
448   68065.80              1  138777.00  2025-01-31 00:00:00  Entrepr  2025
449  127299.34              2  124694.99  2025-01-31 00:00:00  Entrepr  2025
450  174937.64              1   40084.32  2025-01-31 00:00:00  Entrepr  2025
451       0.00              2  119232.33  2025-01-31 00:00:00  Entrepr  2025
452  110071.10              1   43921.36                  not  Entrepr  2025

     Month  Day    Weekday
0        1    1     Sunday
1        1    2     Monday
2        1    3    Tuesday
3        1    4  Wednesday
4        1    5   Thursday
..     ...  ...        ...
448      1   31     Friday
449      1   31     Friday
450      1   31     Friday
451      1   31     Friday
452      1   31     Friday

[453 rows x 16 columns]

In [5]:
df.astype('object')

,CustomerId,Name,CreditScore,Country,Gender,Age,Tenure,Balance,NumOfProducts,Salary,Date,Dep,Year,Month,Day,Weekday
0,15634602,Hargrave,619,France,Female,42,2,0.0,1,101348.88,2023-01-01 00:00:00,Bank,2023,1,1,Sunday
1,15634602,Hargrave,619,France,Female,42,2,0.0,1,101348.88,2023-01-02 00:00:00,Bank,2023,1,2,Monday
2,15634602,Onio,502,France,Female,42,8,159660.8,3,112542.58,2023-01-03 00:00:00,Bank,2023,1,3,Tuesday
3,15634602,Onio,502,France,Female,42,8,159660.8,3,112542.58,2023-01-04 00:00:00,Bank,2023,1,4,Wednesday
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,79084.1,2023-01-05 00:00:00,Bank,2023,1,5,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
448,15694860,Uspensky,675,France,Female,38,6,68065.8,1,138777.0,2025-01-31 00:00:00,Entrepr,2025,1,31,Friday
449,15658169,Cook,778,Spain,Female,47,6,127299.34,2,124694.99,2025-01-31 00:00:00,Entrepr,2025,1,31,Friday
450,15794396,Newbold,494,Germany,Female,38,7,174937.64,1,40084.32,2025-01-31 00:00:00,Entrepr,2025,1,31,Friday
451,15785798,Uchechukwu,850,France,Male,40,9,0.0,2,119232.33,2025-01-31 00:00:00,Entrepr,2025,1,31,Friday
452,15710825,Ch'en,592,Spain,Male,31,7,110071.1,1,43921.36,not,Entrepr,2025,1,31,Friday

In [6]:
df.dtypes

CustomerId         int64
Name              object
CreditScore        int64
Country           object
Gender            object
Age                int64
Tenure             int64
Balance          float64
NumOfProducts      int64
Salary           float64
Date              object
Dep               object
Year               int64
Month              int64
Day                int64
Weekday           object
dtype: object

In [9]:
df['Date'] = pd.to_datetime(df['Date'], errors = "coerce")

print(df.dtypes)

In [10]:
df.dtypes

CustomerId                int64
Name                     object
CreditScore               int64
Country                  object
Gender                   object
Age                       int64
Tenure                    int64
Balance                 float64
NumOfProducts             int64
Salary                  float64
Date             datetime64[ns]
Dep                      object
Year                      int64
Month                     int64
Day                       int64
Weekday                  object
dtype: object

In [11]:
df['formatted_date'] = df['Date'].dt.strftime("%d-%b-%Y")

In [12]:
print(df
     )

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36        NaT  Entrepr  2025      1

     Day    Weekday formatted_date
0      1     Sunday    01-Jan-2023
1      2     Monday    02-Jan-2023
2      3    Tuesday    03-Jan-2023
3      4  Wednesday    04-Jan-2023
4      5   Thursday    05-Jan-2023
..   ...        ...            ...
448   31     Friday    31-Jan-2025
449   31     Friday    31-Jan-2025
450   31     Friday    31-Jan-2025
451   31     Friday    31-Jan-2025
452   31     Friday            NaN

[453 rows x 17 columns]

In [20]:
df['Date'] = df['Date'].fillna(pd.to_datetime('22-11-2001', format = '%d-%m-%Y'))

print(df)

In [16]:
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2001-11-22  Entrepr  2025      1

     Day    Weekday formatted_date
0      1     Sunday    01-Jan-2023
1      2     Monday    02-Jan-2023
2      3    Tuesday    03-Jan-2023
3      4  Wednesday    04-Jan-2023
4      5   Thursday    05-Jan-2023
..   ...        ...            ...
448   31     Friday    31-Jan-2025
449   31     Friday    31-Jan-2025
450   31     Friday    31-Jan-2025
451   31     Friday    31-Jan-2025
452   31     Friday            NaN

[453 rows x 17 columns]

In [21]:
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep  Year  Month  \
0         0.00              1  101348.88 2023-01-01     Bank  2023      1
1         0.00              1  101348.88 2023-01-02     Bank  2023      1
2    159660.80              3  112542.58 2023-01-03     Bank  2023      1
3    159660.80              3  112542.58 2023-01-04     Bank  2023      1
4    125510.82              1   79084.10 2023-01-05     Bank  2023      1
..         ...            ...        ...        ...      ...   ...    ...
448   68065.80              1  138777.00 2025-01-31  Entrepr  2025      1
449  127299.34              2  124694.99 2025-01-31  Entrepr  2025      1
450  174937.64              1   40084.32 2025-01-31  Entrepr  2025      1
451       0.00              2  119232.33 2025-01-31  Entrepr  2025      1
452  110071.10              1   43921.36 2001-11-22  Entrepr  2025      1

     Day    Weekday formatted_date
0      1     Sunday    01-Jan-2023
1      2     Monday    02-Jan-2023
2      3    Tuesday    03-Jan-2023
3      4  Wednesday    04-Jan-2023
4      5   Thursday    05-Jan-2023
..   ...        ...            ...
448   31     Friday    31-Jan-2025
449   31     Friday    31-Jan-2025
450   31     Friday    31-Jan-2025
451   31     Friday    31-Jan-2025
452   31     Friday            NaN

[453 rows x 17 columns]

In [22]:
df['Date'].dtypes

dtype('<M8[ns]')

In [23]:
df.dtypes

CustomerId                 int64
Name                      object
CreditScore                int64
Country                   object
Gender                    object
Age                        int64
Tenure                     int64
Balance                  float64
NumOfProducts              int64
Salary                   float64
Date              datetime64[ns]
Dep                       object
Year                       int64
Month                      int64
Day                        int64
Weekday                   object
formatted_date            object
dtype: object

In [37]:
'''df['Date'] = pd.to_datetime(df['Date'], format='%d-%b-%Y', errors='coerce')

# Fill NaN values with a specific date
df['Date'] = df['Date'].fillna(pd.to_datetime('22-Nov-2001'))'''

df['formatted_date'] = pd.to_datetime(df['formatted_date'], format = '%d-%b-%Y', errors = 'coerce')
df['formatted_date'] = df['formatted_date'].fillna(pd.to_datetime('21-mar-2025'))
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary  ...  Year Month  Day    Weekday  \
0         0.00              1  101348.88  ...  2023     1    1     Sunday
1         0.00              1  101348.88  ...  2023     1    2     Monday
2    159660.80              3  112542.58  ...  2023     1    3    Tuesday
3    159660.80              3  112542.58  ...  2023     1    4  Wednesday
4    125510.82              1   79084.10  ...  2023     1    5   Thursday
..         ...            ...        ...  ...   ...   ...  ...        ...
448   68065.80              1  138777.00  ...  2025     1   31     Friday
449  127299.34              2  124694.99  ...  2025     1   31     Friday
450  174937.64              1   40084.32  ...  2025     1   31     Friday
451       0.00              2  119232.33  ...  2025     1   31     Friday
452  110071.10              1   43921.36  ...  2025     1   31     Friday

     formatted_date date_plus_12_days date_minus_1month date_plus_10_days  \
0        2023-01-01        2023-01-11        2022-11-01        2023-01-11
1        2023-01-02        2023-01-12        2022-11-02        2023-01-12
2        2023-01-03        2023-01-13        2022-11-03        2023-01-13
3        2023-01-04        2023-01-14        2022-11-04        2023-01-14
4        2023-01-05        2023-01-15        2022-11-05        2023-01-15
..              ...               ...               ...               ...
448      2025-01-31        2025-02-10        2024-11-30        2025-02-10
449      2025-01-31        2025-02-10        2024-11-30        2025-02-10
450      2025-01-31        2025-02-10        2024-11-30        2025-02-10
451      2025-01-31        2025-02-10        2024-11-30        2025-02-10
452      2001-11-22        2001-12-02        2001-09-22        2001-12-02

    date_minus_2month days_diff
0          2022-11-01       -42
1          2022-11-02       -41
2          2022-11-03       -40
3          2022-11-04       -39
4          2022-11-05       -38
..                ...       ...
448        2024-11-30       719
449        2024-11-30       719
450        2024-11-30       719
451        2024-11-30       719
452        2001-09-22     -7752

[453 rows x 22 columns]

In [33]:
'''df['date_plus_10_days'] = df['date'] + pd.Timedelta(days=10)
df['date_minus_1_month'] = df['date'] - pd.DateOffset(months=1)

print(df[['date', 'date_plus_10_days', 'date_minus_1_month']])
'''
# this is used to plus or minus in date

df['date_plus_10_days'] = df['Date']+ pd.Timedelta(days = 10 )
df['date_minus_2month'] = df['Date'] - pd.DateOffset(months = 2)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary  ...      Dep  Year  Month  Day  \
0         0.00              1  101348.88  ...     Bank  2023      1    1
1         0.00              1  101348.88  ...     Bank  2023      1    2
2    159660.80              3  112542.58  ...     Bank  2023      1    3
3    159660.80              3  112542.58  ...     Bank  2023      1    4
4    125510.82              1   79084.10  ...     Bank  2023      1    5
..         ...            ...        ...  ...      ...   ...    ...  ...
448   68065.80              1  138777.00  ...  Entrepr  2025      1   31
449  127299.34              2  124694.99  ...  Entrepr  2025      1   31
450  174937.64              1   40084.32  ...  Entrepr  2025      1   31
451       0.00              2  119232.33  ...  Entrepr  2025      1   31
452  110071.10              1   43921.36  ...  Entrepr  2025      1   31

       Weekday formatted_date date_plus_12_days date_minus_1month  \
0       Sunday     2023-01-01        2023-01-11        2022-11-01
1       Monday     2023-01-02        2023-01-12        2022-11-02
2      Tuesday     2023-01-03        2023-01-13        2022-11-03
3    Wednesday     2023-01-04        2023-01-14        2022-11-04
4     Thursday     2023-01-05        2023-01-15        2022-11-05
..         ...            ...               ...               ...
448     Friday     2025-01-31        2025-02-10        2024-11-30
449     Friday     2025-01-31        2025-02-10        2024-11-30
450     Friday     2025-01-31        2025-02-10        2024-11-30
451     Friday     2025-01-31        2025-02-10        2024-11-30
452     Friday     2001-11-22        2001-12-02        2001-09-22

    date_plus_10_days date_minus_2month
0          2023-01-11        2022-11-01
1          2023-01-12        2022-11-02
2          2023-01-13        2022-11-03
3          2023-01-14        2022-11-04
4          2023-01-15        2022-11-05
..                ...               ...
448        2025-02-10        2024-11-30
449        2025-02-10        2024-11-30
450        2025-02-10        2024-11-30
451        2025-02-10        2024-11-30
452        2001-12-02        2001-09-22

[453 rows x 21 columns]

In [36]:
'''df['days_diff'] = (df['date'] - pd.to_datetime('2023-01-01')).dt.days
print(df[['date', 'days_diff']])
'''
df['days_diff'] = (df['Date']+ pd.to_datetime('2025-3-21')).dt.days
print(df[['Date', 'days_diff']])

TypeError: cannot add DatetimeArray and Timestamp

In [47]:
#age calculater
from datetime import datetime
from dateutil.relativedelta import relativedelta
import pandas as pd
curr_date = datetime.now()
user_input = input('Enter_Date: ')
yours_date = pd.to_datetime(user_input, format = '%d-%b-%Y')

total_days = pd.to_datetime(curr_date) - pd.to_datetime(yours_date)
age = relativedelta(curr_date, yours_date)
print('Total days from your birth :',total_days)
print(age)
# calculation is came little bit wrong

Enter_Date:  22-nov-2001

Total days from your birth : 8520 days 18:00:50.748807
relativedelta(years=+23, months=+3, days=+27, hours=+18, seconds=+50, microseconds=+748807)

In [48]:
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary  ...  Year Month  Day    Weekday  \
0         0.00              1  101348.88  ...  2023     1    1     Sunday
1         0.00              1  101348.88  ...  2023     1    2     Monday
2    159660.80              3  112542.58  ...  2023     1    3    Tuesday
3    159660.80              3  112542.58  ...  2023     1    4  Wednesday
4    125510.82              1   79084.10  ...  2023     1    5   Thursday
..         ...            ...        ...  ...   ...   ...  ...        ...
448   68065.80              1  138777.00  ...  2025     1   31     Friday
449  127299.34              2  124694.99  ...  2025     1   31     Friday
450  174937.64              1   40084.32  ...  2025     1   31     Friday
451       0.00              2  119232.33  ...  2025     1   31     Friday
452  110071.10              1   43921.36  ...  2025     1   31     Friday

     formatted_date date_plus_12_days date_minus_1month date_plus_10_days  \
0        2023-01-01        2023-01-11        2022-11-01        2023-01-11
1        2023-01-02        2023-01-12        2022-11-02        2023-01-12
2        2023-01-03        2023-01-13        2022-11-03        2023-01-13
3        2023-01-04        2023-01-14        2022-11-04        2023-01-14
4        2023-01-05        2023-01-15        2022-11-05        2023-01-15
..              ...               ...               ...               ...
448      2025-01-31        2025-02-10        2024-11-30        2025-02-10
449      2025-01-31        2025-02-10        2024-11-30        2025-02-10
450      2025-01-31        2025-02-10        2024-11-30        2025-02-10
451      2025-01-31        2025-02-10        2024-11-30        2025-02-10
452      2001-11-22        2001-12-02        2001-09-22        2001-12-02

    date_minus_2month days_diff
0          2022-11-01       -42
1          2022-11-02       -41
2          2022-11-03       -40
3          2022-11-04       -39
4          2022-11-05       -38
..                ...       ...
448        2024-11-30       719
449        2024-11-30       719
450        2024-11-30       719
451        2024-11-30       719
452        2001-09-22     -7752

[453 rows x 22 columns]

In [49]:
df.columns

Index(['CustomerId', 'Name', 'CreditScore', 'Country', 'Gender', 'Age',
       'Tenure', 'Balance', 'NumOfProducts', 'Salary', 'Date', 'Dep', 'Year',
       'Month', 'Day', 'Weekday', 'formatted_date', 'date_plus_12_days',
       'date_minus_1month', 'date_plus_10_days', 'date_minus_2month',
       'days_diff'],
      dtype='object')

In [50]:
filtered_data = df[(df['Date'] >= '2023-01-05 ') & (df['Date'] <='2024-11-30' )]
print(filtered_data)

     CustomerId      Name  CreditScore  Country  Gender  Age  Tenure  \
4      15737888  Mitchell          850    Spain  Female   43       2
5      15574012       Chu          645    Spain    Male   44       8
6      15574012  Bartlett          822   France    Male   50       7
7      15574012  Bartlett          376  Germany  Female   29       4
8      15574012  Bartlett          501   France    Male   44       4
..          ...       ...          ...      ...     ...  ...     ...
407    15745354  Franklin          611    Spain  Female   37       4
408    15701376     K'ung          668  Germany    Male   37      10
409    15691625        Ko          537  Germany  Female   41       3
410    15566594  McKenzie          709    Spain    Male   23      10
411    15760431      Pino          850   France    Male   38       1

       Balance  NumOfProducts     Salary  ...  Year Month  Day    Weekday  \
4    125510.82              1   79084.10  ...  2023     1    5   Thursday
5    113755.78              2  149756.71  ...  2023     1    6     Friday
6         0.00              2   10062.80  ...  2023     1    7   Saturday
7    115046.74              4  119346.88  ...  2023     1    8     Sunday
8    142051.07              2   74940.50  ...  2023     1    9     Monday
..         ...            ...        ...  ...   ...   ...  ...        ...
407       0.00              2  125696.26  ...  2024    10    2  Wednesday
408  152958.29              2  159585.61  ...  2024    10    3   Thursday
409  138306.34              1  106761.47  ...  2024    10    4     Friday
410       0.00              2  129590.18  ...  2024    10    5   Saturday
411       0.00              2   80006.65  ...  2024    10    6     Sunday

     formatted_date date_plus_12_days date_minus_1month date_plus_10_days  \
4        2023-01-05        2023-01-15        2022-11-05        2023-01-15
5        2023-01-06        2023-01-16        2022-11-06        2023-01-16
6        2023-01-07        2023-01-17        2022-11-07        2023-01-17
7        2023-01-08        2023-01-18        2022-11-08        2023-01-18
8        2023-01-09        2023-01-19        2022-11-09        2023-01-19
..              ...               ...               ...               ...
407      2024-10-02        2024-10-12        2024-08-02        2024-10-12
408      2024-10-03        2024-10-13        2024-08-03        2024-10-13
409      2024-10-04        2024-10-14        2024-08-04        2024-10-14
410      2024-10-05        2024-10-15        2024-08-05        2024-10-15
411      2024-10-06        2024-10-16        2024-08-06        2024-10-16

    date_minus_2month days_diff
4          2022-11-05       -38
5          2022-11-06       -37
6          2022-11-07       -36
7          2022-11-08       -35
8          2022-11-09       -34
..                ...       ...
407        2024-08-02       598
408        2024-08-03       599
409        2024-08-04       600
410        2024-08-05       601
411        2024-08-06       602

[408 rows x 22 columns]

In [53]:
'''date_range = pd.date_range(start='2023-01-01', periods=5, freq='D')'''
#daterange
date_rang = pd.date_range(start = '2023-jan-22', periods = 11, freq = 'D')
print(date_rang)

DatetimeIndex(['2023-01-22', '2023-01-23', '2023-01-24', '2023-01-25',
               '2023-01-26', '2023-01-27', '2023-01-28', '2023-01-29',
               '2023-01-30', '2023-01-31', '2023-02-01'],
              dtype='datetime64[ns]', freq='D')